import numpy as np

#5.8函数
def func_8_(x,u):
    return -9*x[0]-10*x[1]-u*(np.log(100-x[0]-x[1])+np.log(x[0])+np.log(x[1])+np.log(50-x[0]+x[1]))
def gfunc_8_(x,u):
    return np.array([-9+u/(100-x[0]-x[1])-u/x[0]+u/(50-x[0]+x[1]),
                     -10+u/(100-x[0]-x[1])-u/x[1]-u/(50-x[0]+x[1])])
def hess_8_(x,u):
    return np.array([[u/((100-x[0]-x[1])**2)+u/(x[0]**2)+u/((50-x[0]+x[1])**2)
                        ,u/((100-x[0]-x[1])**2)-u/((50-x[0]+x[1])**2)],
                    [u/((100-x[0]-x[1])**2)-u/((50-x[0]+x[1])**2),
                     u/((100-x[0]-x[1])**2)+u/(x[1]**2)+u/((50-x[0]+x[1])**2)]])

